app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "Book was successfully created."
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "saa"], ["body", "saa"], ["created_at", "2023-02-05 20:37:58.304748"], ["updated_at", "2023-02-05 20:37:58.304748"]]
SELECT "books".* FROM "books"